//Posts

let posts = [{
    idPost : 1,
    titlePost : "ينتقل عنوان المدونة إلى هنا",
    urlImgPost : "./images/single-blog-image-bg-1.jpg",
    datePost : "آخر تحديث منذ 3 دقائق",
    contentPost : "بدا الاكتئاب وكأنه أغنية نصف ذكية ، لا يمكن غنائها في المنزل أو المدرسة أو الكنيسة. لقد كان شيئًا سريع الزوال لدرجة أنه يبدو أنه فقد معناه. كان من غير المحتمل أن يصاب أحد الأطفال بالفيروس بطريقة ما. كانت الحياة مع الأسقف بسيطة: صباحًا مع الصلاة وطبق من الموز المقلي ؛ بعد الظهر مع يسوع والمسابح والصدف ؛ أمسيات مع القصص والترانيم. من المستحيل أن ينتهي الأمر بالطفل الذي يعيش مع بيشوب إلى الإصابة بفيروس الاكتئاب."
},
{
    idPost : 2,
    titlePost : "ينتقل عنوان المدونة إلى هنا",
    urlImgPost : "./images/single-blog-image-bg-2.jpg",
    datePost : "آخر تحديث منذ 3 دقائق",
    contentPost : "بدا الاكتئاب وكأنه أغنية نصف ذكية ، لا يمكن غنائها في المنزل أو المدرسة أو الكنيسة. لقد كان شيئًا سريع الزوال لدرجة أنه يبدو أنه فقد معناه. كان من غير المحتمل أن يصاب أحد الأطفال بالفيروس بطريقة ما. كانت الحياة مع الأسقف بسيطة: صباحًا مع الصلاة وطبق من الموز المقلي ؛ بعد الظهر مع يسوع والمسابح والصدف ؛ أمسيات مع القصص والترانيم. من المستحيل أن ينتهي الأمر بالطفل الذي يعيش مع بيشوب إلى الإصابة بفيروس الاكتئاب."
},
{
    idPost : 3,
    titlePost : "ينتقل عنوان المدونة إلى هنا",
    urlImgPost : "./images/single-blog-image-bg-3.jpg",
    datePost : "آخر تحديث منذ 3 دقائق",
    contentPost : "بدا الاكتئاب وكأنه أغنية نصف ذكية ، لا يمكن غنائها في المنزل أو المدرسة أو الكنيسة. لقد كان شيئًا سريع الزوال لدرجة أنه يبدو أنه فقد معناه. كان من غير المحتمل أن يصاب أحد الأطفال بالفيروس بطريقة ما. كانت الحياة مع الأسقف بسيطة: صباحًا مع الصلاة وطبق من الموز المقلي ؛ بعد الظهر مع يسوع والمسابح والصدف ؛ أمسيات مع القصص والترانيم. من المستحيل أن ينتهي الأمر بالطفل الذي يعيش مع بيشوب إلى الإصابة بفيروس الاكتئاب.",
},
{
    idPost : 4,
    titlePost : "ينتقل عنوان المدونة إلى هنا",
    urlImgPost : "./images/single-blog-image-bg-4.jpg",
    datePost : "آخر تحديث منذ 3 دقائق",
    contentPost : "بدا الاكتئاب وكأنه أغنية نصف ذكية ، لا يمكن غنائها في المنزل أو المدرسة أو الكنيسة. لقد كان شيئًا سريع الزوال لدرجة أنه يبدو أنه فقد معناه. كان من غير المحتمل أن يصاب أحد الأطفال بالفيروس بطريقة ما. كانت الحياة مع الأسقف بسيطة: صباحًا مع الصلاة وطبق من الموز المقلي ؛ بعد الظهر مع يسوع والمسابح والصدف ؛ أمسيات مع القصص والترانيم. من المستحيل أن ينتهي الأمر بالطفل الذي يعيش مع بيشوب إلى الإصابة بفيروس الاكتئاب.",
},
{
    idPost : 5,
    titlePost : "ينتقل عنوان المدونة إلى هنا",
    urlImgPost : "./images/single-blog-image-bg-5.jpg",
    datePost : "آخر تحديث منذ 3 دقائق",
    contentPost : "بدا الاكتئاب وكأنه أغنية نصف ذكية ، لا يمكن غنائها في المنزل أو المدرسة أو الكنيسة. لقد كان شيئًا سريع الزوال لدرجة أنه يبدو أنه فقد معناه. كان من غير المحتمل أن يصاب أحد الأطفال بالفيروس بطريقة ما. كانت الحياة مع الأسقف بسيطة: صباحًا مع الصلاة وطبق من الموز المقلي ؛ بعد الظهر مع يسوع والمسابح والصدف ؛ أمسيات مع القصص والترانيم. من المستحيل أن ينتهي الأمر بالطفل الذي يعيش مع بيشوب إلى الإصابة بفيروس الاكتئاب.",
}];


// save Posts in LocalStorage
localStorage.setItem('posts',JSON.stringify(posts));